// automatically generated by rust-bindgen 0.72.0

#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct EFXEAXREVERBPROPERTIES {
    pub flDensity: f32,
    pub flDiffusion: f32,
    pub flGain: f32,
    pub flGainHF: f32,
    pub flGainLF: f32,
    pub flDecayTime: f32,
    pub flDecayHFRatio: f32,
    pub flDecayLFRatio: f32,
    pub flReflectionsGain: f32,
    pub flReflectionsDelay: f32,
    pub flReflectionsPan: [f32; 3usize],
    pub flLateReverbGain: f32,
    pub flLateReverbDelay: f32,
    pub flLateReverbPan: [f32; 3usize],
    pub flEchoTime: f32,
    pub flEchoDepth: f32,
    pub flModulationTime: f32,
    pub flModulationDepth: f32,
    pub flAirAbsorptionGainHF: f32,
    pub flHFReference: f32,
    pub flLFReference: f32,
    pub flRoomRolloffFactor: f32,
    pub iDecayHFLimit: ::std::os::raw::c_int
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of EFXEAXREVERBPROPERTIES"][::std::mem::size_of::<EFXEAXREVERBPROPERTIES>() - 108usize];
    ["Alignment of EFXEAXREVERBPROPERTIES"]
        [::std::mem::align_of::<EFXEAXREVERBPROPERTIES>() - 4usize];
    ["Offset of field: EFXEAXREVERBPROPERTIES::flDensity"]
        [::std::mem::offset_of!(EFXEAXREVERBPROPERTIES, flDensity) - 0usize];
    ["Offset of field: EFXEAXREVERBPROPERTIES::flDiffusion"]
        [::std::mem::offset_of!(EFXEAXREVERBPROPERTIES, flDiffusion) - 4usize];
    ["Offset of field: EFXEAXREVERBPROPERTIES::flGain"]
        [::std::mem::offset_of!(EFXEAXREVERBPROPERTIES, flGain) - 8usize];
    ["Offset of field: EFXEAXREVERBPROPERTIES::flGainHF"]
        [::std::mem::offset_of!(EFXEAXREVERBPROPERTIES, flGainHF) - 12usize];
    ["Offset of field: EFXEAXREVERBPROPERTIES::flGainLF"]
        [::std::mem::offset_of!(EFXEAXREVERBPROPERTIES, flGainLF) - 16usize];
    ["Offset of field: EFXEAXREVERBPROPERTIES::flDecayTime"]
        [::std::mem::offset_of!(EFXEAXREVERBPROPERTIES, flDecayTime) - 20usize];
    ["Offset of field: EFXEAXREVERBPROPERTIES::flDecayHFRatio"]
        [::std::mem::offset_of!(EFXEAXREVERBPROPERTIES, flDecayHFRatio) - 24usize];
    ["Offset of field: EFXEAXREVERBPROPERTIES::flDecayLFRatio"]
        [::std::mem::offset_of!(EFXEAXREVERBPROPERTIES, flDecayLFRatio) - 28usize];
    ["Offset of field: EFXEAXREVERBPROPERTIES::flReflectionsGain"]
        [::std::mem::offset_of!(EFXEAXREVERBPROPERTIES, flReflectionsGain) - 32usize];
    ["Offset of field: EFXEAXREVERBPROPERTIES::flReflectionsDelay"]
        [::std::mem::offset_of!(EFXEAXREVERBPROPERTIES, flReflectionsDelay) - 36usize];
    ["Offset of field: EFXEAXREVERBPROPERTIES::flReflectionsPan"]
        [::std::mem::offset_of!(EFXEAXREVERBPROPERTIES, flReflectionsPan) - 40usize];
    ["Offset of field: EFXEAXREVERBPROPERTIES::flLateReverbGain"]
        [::std::mem::offset_of!(EFXEAXREVERBPROPERTIES, flLateReverbGain) - 52usize];
    ["Offset of field: EFXEAXREVERBPROPERTIES::flLateReverbDelay"]
        [::std::mem::offset_of!(EFXEAXREVERBPROPERTIES, flLateReverbDelay) - 56usize];
    ["Offset of field: EFXEAXREVERBPROPERTIES::flLateReverbPan"]
        [::std::mem::offset_of!(EFXEAXREVERBPROPERTIES, flLateReverbPan) - 60usize];
    ["Offset of field: EFXEAXREVERBPROPERTIES::flEchoTime"]
        [::std::mem::offset_of!(EFXEAXREVERBPROPERTIES, flEchoTime) - 72usize];
    ["Offset of field: EFXEAXREVERBPROPERTIES::flEchoDepth"]
        [::std::mem::offset_of!(EFXEAXREVERBPROPERTIES, flEchoDepth) - 76usize];
    ["Offset of field: EFXEAXREVERBPROPERTIES::flModulationTime"]
        [::std::mem::offset_of!(EFXEAXREVERBPROPERTIES, flModulationTime) - 80usize];
    ["Offset of field: EFXEAXREVERBPROPERTIES::flModulationDepth"]
        [::std::mem::offset_of!(EFXEAXREVERBPROPERTIES, flModulationDepth) - 84usize];
    ["Offset of field: EFXEAXREVERBPROPERTIES::flAirAbsorptionGainHF"]
        [::std::mem::offset_of!(EFXEAXREVERBPROPERTIES, flAirAbsorptionGainHF) - 88usize];
    ["Offset of field: EFXEAXREVERBPROPERTIES::flHFReference"]
        [::std::mem::offset_of!(EFXEAXREVERBPROPERTIES, flHFReference) - 92usize];
    ["Offset of field: EFXEAXREVERBPROPERTIES::flLFReference"]
        [::std::mem::offset_of!(EFXEAXREVERBPROPERTIES, flLFReference) - 96usize];
    ["Offset of field: EFXEAXREVERBPROPERTIES::flRoomRolloffFactor"]
        [::std::mem::offset_of!(EFXEAXREVERBPROPERTIES, flRoomRolloffFactor) - 100usize];
    ["Offset of field: EFXEAXREVERBPROPERTIES::iDecayHFLimit"]
        [::std::mem::offset_of!(EFXEAXREVERBPROPERTIES, iDecayHFLimit) - 104usize];
};
pub type LPEFXEAXREVERBPROPERTIES = *mut EFXEAXREVERBPROPERTIES;
